app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses" ORDER BY category, title
---
  def index
    courses = Course.where("date >= :today", today: Date.today).order("date ASC").all
    #@courses_by_date = courses.group_by{|c| c.date.strftime("%^A, %-d %^B")}
    @courses_by_date = courses.group_by{|c| c.date.strftime("%d/%m/%Y")}