app/controllers/registrations_controller.rb

INSERT INTO "users" ("age", "created_at", "current_sign_in_at", "current_sign_in_ip", "email", "encrypted_password", "firstname", "last_sign_in_at", "last_sign_in_ip", "lastname", "linkedin", "p1", "p2", "profile", "q1", "q2", "q3", "q4", "q5", "q6", "remember_created_at", "reset_password_sent_at", "reset_password_token", "sign_in_count", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25) RETURNING "id"
UPDATE "users" SET "last_sign_in_at" = '2013-05-31 09:27:15.662774', "current_sign_in_at" = '2013-05-31 09:27:15.662774', "last_sign_in_ip" = '127.0.0.1', "current_sign_in_ip" = '127.0.0.1', "sign_in_count" = 1, "updated_at" = '2013-05-31 09:27:15.664036' WHERE "users"."id" = 1
---
  def create
      super
      UserMailer.welcome_email(@user).deliver if @user.save