app/controllers/suggestions_controller.rb

INSERT INTO "suggestions" ("content", "created_at", "email", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "heheh"], ["created_at", Thu, 27 Jun 2013 15:52:48 UTC +00:00], ["email", "test@gmail.com"], ["updated_at", Thu, 27 Jun 2013 15:52:48 UTC +00:00]]
---
  def create
    suggestion = Suggestion.new(params[:suggestion])
    suggestion.save ? flash[:notice] = "Merci pour ta suggestion !" : flash[:notice] = "Tu as du oublier un champ.."